/* [ua]
Шифр Цезаря
Одним з найпростіших і найпоширеніших шифрів є шифр Цезаря, також відомий як шифр зсуву. У шифрі зсуву значення літери зміщене на встановлену кількість.
Часто використовують шифр ROT13, який зміщує літеру на 13 місць. Таким чином, A ↔ N, B ↔ O і так далі.
Напишіть функцію, яка приймає закодований рядок ROT13 як вхідні дані та повертає декодований.
Всі літери повинні бути великими. Не замінюйте неалфавітні символи (пробіли, знаки пунктуації), але перенесіть їх.

*/

function rot13(str) {
  let alphabet = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
  let regex = /[A-Za-z]/;
  let decrypted = "";

  for (let i = 0; i < str.length; i++) {
    if (regex.test(str[i])) {
      let charCode = str.charCodeAt(i);/* отримуємо код поточної літери. */
      let index = alphabet.indexOf(String.fromCharCode(charCode));/* знаходимо індекс поточної літери в алфавіті alphabet */
      decrypted += alphabet[(index + 13) % 26];/* додаємо до рядка encrypted літеру, яка знаходиться на 13 позицій правіше поточної літери в алфавіті. Якщо індекс виходить за межі алфавіту, він обчислюється знову з початку за допомогою операції модуля % 26 */
    } else {
      decrypted += str[i];/* якщо поточний символ не є літерою, він додається до рядка encrypted без змін. */
    }
  }

  return decrypted;
}

console.log(rot13("SERR PBQR PNZC"));