/* 
[ua]

Перетворіть подане число в римське число.

Римські числа 	Арабські числа
M 	1000
CM 	900
D 	500
CD 	400
С 	100
XC 	90
L 	50
XL 	40
X 	10
IX 	9
V 	5
IV 	4
I 	1

Всі римські числа повинні бути написаними великими літерами.

*/

function convertToRoman(num) {
  const romanNumbers = [
    [1000, "M"],
    [900, "CM"],
    [500, "D"],
    [400, "CD"],
    [100, "C"],
    [90, "XC"],
    [50, "L"],
    [40, "XL"],
    [10, "X"],
    [9, "IX"],
    [5, "V"],
    [4, "IV"],
    [1, "I"]
  ];
  let roman = "";

  for (let i = 0; i < romanNumbers.length; i++) {
    while (num >= romanNumbers[i][0]) {/* Розглядаємо кожен елемент в romanNumbers в порядку спадання. Починаючи з 1000 (M), перевіряє, чи число, яке ми перетворюємо, більше або рівне 1000.*/
      roman += romanNumbers[i][1];/*Поки число, яке ми перетворюємо, більше або рівне 1000, ми додаємо "M" до римського числа roman і віднімаємо 1000 від числа, яке ми перетворюємо. Після цього переходимо до наступного числа-римського еквівалента (900 - "CM") і так далі. */
      num -= romanNumbers[i][0];/* Тут віднімаємо */
    }
  }

  return roman;
}

console.log(convertToRoman(967)); 